# AnalyticConstructionTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties..::..AnalyticConstructionTypeId Property
FamilyThermalProperties Class See Also
---
The construction gbXML type. This value corresponds to the 'id' property of a constructionType node in Constructions.xml.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string AnalyticConstructionTypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AnalyticConstructionTypeId As String
	Get
```

Visual C++
---
```text
public:
property String^ AnalyticConstructionTypeId {
	String^ get ();
}
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace